InformationRegisters/ДоходыПредыдущегоМестаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДоходыПредыдущегоМестаРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененнаяЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВОСМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОПенсионномОбеспеченииФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПенсионномОбеспеченииФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПенсионерПоВозрасту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПенсионерПоВыслугеЛет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОФизическихЛицахУчастникахВОВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОФизическихЛицахУчастникахВОВ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииФизическихЛицУчастниковВОВ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусФизическихЛицКакНалогоплательщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусФизическихЛицКакНалогоплательщиков</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыФизическихЛицНалогоплательщиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмеетПравоНаПенсионноеОбеспечение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодлежитСоциальномуСтрахованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодлежитСоциальномуМедицинскомуСтрахованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВычетыФизическихЛицИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВычетыФизическихЛицИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредоставлятьВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛьготыФизическихЛицИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛьготыФизическихЛицИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредоставлятьЛьготу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияЛицаПолучателяЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЛицПолучателейЛьготИПН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрочиеВычетыФизическихЛицИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрочиеВычетыФизическихЛицИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыПоПрочимВыплатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыПоПрочимВыплатам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПрочихВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НалогиВзносыОтчисленияРасчетыСБюджетомИФондами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалогВзнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ЗащитаПерсональныхДанныхПереопределяемый/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет задать настройки для регистрации событий доступа к персональным данным.
//
// При расширении состава субъектов персональных данных следует иметь в виду, что регистрация событий для них
// не начнется автоматически (это отдельно настраивает администратор программы). Однако если необходимо управлять этим
// при переходе на новую версию программы, то следует реализовать обработчик обновления, вызывающий 
// процедуру ЗащитаПерсональныхДанных.УстановитьИспользованиеСобытияДоступ.
//
// Параметры:
//   ТаблицаСведений    - ТаблицаЗначений:
//    * Объект          - Строка - полное имя объекта метаданных с персональными данными;
//    * ПоляРегистрации - Строка - имена полей, значения которых выводятся в журнал событий доступа к персональным
//                                 данным для идентификации субъекта персональных данных. Для ссылочных типов, 
//                                 как правило, это поле "Ссылка". Отдельные поля регистрации отделяются запятой, 
//                                 альтернативные - символом "|";
//    * ПоляДоступа     - Строка - имена полей доступа через запятую. Обращение (попытка доступа) к этим полям 
//                                 приводит к записи журнала;
//    * ОбластьДанных	 - Строка - идентификатор категории данных.
//
// Пример:
//  Сведения = ТаблицаСведений.Добавить();
//  Сведения.Объект				= "Справочник.ФизическиеЛица";
//  Сведения.ПоляРегистрации	= "Ссылка";
//  Сведения.ПоляДоступа		= "Наименование";
//  Сведения.ОбластьДанных		= "ФИО";
//
//  Сведения = ТаблицаСведений.Добавить();
//  Сведения.Объект				= "Справочник.ФизическиеЛица";
//  Сведения.ПоляРегистрации	= "Ссылка";
//  Сведения.ПоляДоступа		= "СерияДокумента,НомерДокумента,КемВыданДокумент,ДатаВыдачиДокумента";
//  Сведения.ОбластьДанных		= "ПаспортныеДанные";
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	МенеджерОборудованияВызовСервера.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	
	ЗарплатаКадры.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	
	// ЗУПК
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ДоходыПредыдущегоМестаРаботы";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "СуммаДохода,ПримененнаяЛьгота,ВОСМС";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ПенсионерПоВозрасту,ПенсионерПоВыслугеЛет,ДатаРегистрацииИзменений";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.СведенияОФизическихЛицахУчастникахВОВ";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Статус,ДатаРегистрацииИзменений";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Статус,ИмеетПравоНаПенсионноеОбеспечение,ПодлежитСоциальномуСтрахованию,ПодлежитСоциальномуМедицинскомуСтрахованию";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ВычетыФизическихЛицИПН";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ВидВычета,ПредоставлятьВычет";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ЛьготыФизическихЛицИПН";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ПредоставлятьЛьготу,КатегорияЛицаПолучателяЛьготы";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ПрочиеВычетыФизическихЛицИПН";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ВидВычета,Размер";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.ВзаиморасчетыПоПрочимВыплатам";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "СуммаВзаиморасчетов";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,Сотрудник";
	НовыеСведения.ПоляДоступа		= "СО,СН,ОППВ,ООСМС,ОПВР";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "НалогВзнос";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "НалогВзнос";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.СведенияОбИсчисленииВычетовИПН";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "РазрешенныйВычет,ПримененныйВычет";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ОблагаемыйДоход,НеоблагаемыйДоход,НалогВзнос,ОбъектИсчисления";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.СведенияОДоходахФизическихЛиц";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "СуммаДохода";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "СуммаДохода,НеоблагаемыйДоход";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.ПениПоВзносамИОтчислениям";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Сумма";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ВедомостьНаПеречислениеВзносовОтчислений";
	НовыеСведения.ПоляРегистрации	= "НалогиВзносыОтчисления.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "НалогиВзносыОтчисления.НалогВзнос,НалогиВзносыОтчисления.СуммаПлатежа";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ВедомостьНаПеречислениеПрочихВыплат";
	НовыеСведения.ПоляРегистрации	= "ПрочиеВыплаты.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ПрочиеВыплаты.Сумма";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявлениеНаПредоставлениеВычетовИПН";
	НовыеСведения.ПоляРегистрации	= "Сотрудник";
	НовыеСведения.ПоляДоступа		= "Вычеты.ВидВычетаИПН,ПрочиеВычеты.ВидВычетаИПН";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.РегистрацияПрочихВыплат";
	НовыеСведения.ПоляРегистрации	= "ПрочиеВыплаты.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ПрочиеВыплаты.СуммаНачисления";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ВедомостьНаВозвратПрочихВыплат";
	НовыеСведения.ПоляРегистрации	= "ПрочиеВыплаты.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ПрочиеВыплаты.Сумма";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПеняПоВзносамИОтчислениям";
	НовыеСведения.ПоляРегистрации	= "ИсчислениеПени.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ИсчислениеПени.Сумма,ИсчислениеПени.СуммаЗадолженности";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрекращениеПредоставленияВычетовИПН";
	НовыеСведения.ПоляРегистрации	= "Сотрудник";
	НовыеСведения.ПоляДоступа		= "Месяц";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	// ЗУПК
	
КонецПроцедуры

// Обеспечивает составление коллекции областей персональных данных.
//
// Параметры:
//    КатегорииПерсональныхДанных - ТаблицаЗначений:
//      * Имя			- Строка - идентификатор категории данных.
//      * Представление	- Строка - пользовательское представление категории данных.
//      * Родитель		- Строка - идентификатор родительской категории данных.
//
Процедура ЗаполнитьОбластиПерсональныхДанных(КатегорииПерсональныхДанных) Экспорт
	
	МенеджерОборудованияВызовСервера.ЗаполнитьОбластиПерсональныхДанных(КатегорииПерсональныхДанных);
	
	ЗарплатаКадры.ЗаполнитьОбластиПерсональныхДанных(КатегорииПерсональныхДанных);
	
	// ЗУП 3.1.28.65
	// ЗащитаПерсональныхДанныхЗарплатаКадрыБазовый.ЗаполнитьОбластиПерсональныхДанных
	
	// ЛичныеДанные
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "ФИО";
	НоваяОбласть.Представление = НСтр("ru = 'Фамилия, имя, отчество'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "ДатаМестоРождения";
	НоваяОбласть.Представление = НСтр("ru = 'Дата и место рождения'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "ИНН";
	// ЗУПК
	НоваяОбласть.Представление = НСтр("ru = 'Сведения об индивидуальном идентификационном номере (ИИН)'");
	// ЗУПК
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "МестоРегистрацииПроживания";
	НоваяОбласть.Представление = НСтр("ru = 'Сведения о месте регистрации и месте проживания'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "Образование";
	НоваяОбласть.Представление = НСтр("ru = 'Образование'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "Профессия";
	НоваяОбласть.Представление = НСтр("ru = 'Профессия'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "ОпытРаботы";
	НоваяОбласть.Представление = НСтр("ru = 'Опыт работы'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "БанковскийСчет";
	НоваяОбласть.Представление = НСтр("ru = 'Сведения об открытых банковских счетах'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "СоставСемьи";
	НоваяОбласть.Представление = НСтр("ru = 'Состав семьи'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "Награды";
	НоваяОбласть.Представление = НСтр("ru = 'Награды'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "ДругаяИнформация";
	НоваяОбласть.Представление = НСтр("ru = 'Другая информация'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	// ВоинскийУчет
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "ВоинскийУчет";
	НоваяОбласть.Представление = НСтр("ru = 'Воинский учет'");
	
	// Биометрические
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "Биометрические";
	НоваяОбласть.Представление = НСтр("ru = 'Биометрические'");
	
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "Фотография";
	НоваяОбласть.Представление = НСтр("ru = 'Фотография'");
	НоваяОбласть.Родитель = "Биометрические";
	
	// Иные
	НоваяОбласть = КатегорииПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "Иные";
	НоваяОбласть.Представление = НСтр("ru = 'Иные'");
	// ЗащитаПерсональныхДанныхЗарплатаКадрыБазовый.ЗаполнитьОбластиПерсональныхДанных
	// ЗУП 3.1.28.65
	
КонецПроцедуры

// Вызывается при заполнении формы "Согласие на обработку персональных данных" данными, 
// переданных в качестве параметров, субъектов.
//
// Параметры:
//    СубъектыПерсональныхДанных - Массив из Структура - содержит сведения о субъектах:
//      * Субъект - ОпределяемыйТип.СубъектПерсональныхДанных
//      * ФИО - Строка -
//      * Адрес - Строка -
//      * ПаспортныеДанные - Строка -
//    ДатаАктуальности - Дата - дата, на которую нужно заполнить сведения.
//
Процедура ДополнитьДанныеСубъектовПерсональныхДанных(СубъектыПерсональныхДанных, ДатаАктуальности) Экспорт
	
	ЗарплатаКадры.ДополнитьДанныеСубъектовПерсональныхДанных(СубъектыПерсональныхДанных, ДатаАктуальности);
	
КонецПроцедуры

// Вызывается при заполнении формы "Согласие на обработку персональных данных" данными организации.
//
// Параметры:
//    Организация		- ОпределяемыйТип.Организация - оператор персональных данных.
//    ДанныеОрганизации	- Структура - данные об организации (адрес, ФИО ответственного и т.д.).
//    ДатаАктуальности	- Дата      - дата, на которую нужно заполнить сведения.
//
Процедура ДополнитьДанныеОрганизацииОператораПерсональныхДанных(Организация, ДанныеОрганизации, ДатаАктуальности) Экспорт
	
	ЗарплатаКадры.ДополнитьДанныеОрганизацииОператораПерсональныхДанных(Организация, ДанныеОрганизации, ДатаАктуальности);

КонецПроцедуры

// Вызывается при заполнении формы "Согласие на обработку персональных данных".
// Предназначена для заполнения поля ФИО ответственного за обработку ПДн.
//
// Параметры:
//    ФизическоеЛицо	- ОпределяемыйТип.ФизическоеЛицо - ответственный за обработку персональных данных.
//    ФИО				- Строка - ФИО ответственного, которые нужно заполнить.
//
Процедура ЗаполнитьФИОФизическогоЛица(ФизическоеЛицо, ФИО) Экспорт
	
	ЗарплатаКадры.ЗаполнитьФИОФизическогоЛица(ФизическоеЛицо, ФИО);
	
КонецПроцедуры

// Возвращает организацию по умолчанию.
// 
// Возвращаемое значение:
//  ОпределяемыйТип.Организация
Функция ОрганизацияПоУмолчанию() Экспорт
	
	
	
КонецФункции

#Область УничтожениеПерсональныхДанных

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Уничтожение персональных данных (ПДн) выполняется при проведении документа "Акт об уничтожении персональных данных".
// При этом выполняется поиск объектов информационной базы, в которых содержатся ПДн субъектов.
// Состав таких объектов и их полей описывается в методе ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных.
// В найденных объектах значения реквизитов, содержащих ПДн, очищаются или заменяются случайными значениями.
// Запись объекта с уничтоженными ПДн выполняется в режиме загрузки. В случае необходимости выполнения дополнительных
// действий, при уничтожении ПДн перед записью и после записи объекта можно использовать обработчики
// ПередУничтожениемПерсональныхДанных и ПослеУничтоженияПерсональныхДанных соответственно.

// Заполняет таблицу значений с описанием объектов метаданных и их полей, в которых содержатся персональные данные
// субъектов, подлежащие уничтожению.
// 
// Например, персональные данные физического лицо могут храниться в самом справочнике ФизическиеЛица,
// в регистре сведений ФИОФизическихЛиц, в документе ВедомостьНаВыплатуЗарплатыВБанк и т.д.
// 
// Параметры:
//  ТаблицаСведений - ТаблицаЗначений:
//   * Объект - Строка - полное имя объекта метаданных, в котором содержатся персональные данные субъекта.
//   	Например, "Справочник.ФизическиеЛица".
//   * ПолеСубъект - Строка - имя поля объекта, в котором содержится ссылка на субъекта.
//   	Для стандартных реквизитов используется имя реквизита, например "Ссылка".
//   	Для остальных полей используется полное имя объекта метаданных реквизита, например
//   		"Документ.ВедомостьНаВыплатуЗарплатыВБанк.ТабличнаяЧасть.Состав.Реквизит.ФизическоеЛицо"
//   * Поля - Массив из Строка, Строка - имена полей объекта, в которых содержатся персональные данные субъекта
//   	Для стандартных реквизитов используется имя реквизита, например "Наименование".
//   	Для остальных полей используется полное имя объекта метаданных реквизита, например
//   		"Справочник.ФизическиеЛица.Реквизит.ФИО"
//   * КатегорияДанных - Строка - категория, к которой относятся персональные данные.
//   
// Пример:
// 
//	НовыеСведения = ТаблицаСведений.Добавить();
//	НовыеСведения.Объект = "Справочник.ФизическиеЛица";
//	НовыеСведения.ПолеСубъект = "Ссылка";
//	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Наименование");
//	НовыеСведения.КатегорияДанных = "ФИО";
//
//	НовыеСведения = ТаблицаСведений.Добавить();
//	НовыеСведения.Объект = "Документ.ВедомостьНаВыплатуЗарплатыВБанк";
//	НовыеСведения.ПолеСубъект = "Документ.ВедомостьНаВыплатуЗарплатыВБанк.ТабличнаяЧасть.Состав.Реквизит.ФизическоеЛицо";
//	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
//		"Документ.ВедомостьНаВыплатуЗарплатыВБанк.ТабличнаяЧасть.Состав.Реквизит.СНИЛС");
//	НовыеСведения.КатегорияДанных = "СНИЛС";
Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных(ТаблицаСведений) Экспорт
	
	// ЗУП 3.1.28.65
	// ЗащитаПерсональныхДанныхЗарплатаКадрыБазовый.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
	
	// Справочники.ФизическиеЛица
	МетаданныеФизическиеЛица = Метаданные.Справочники.ФизическиеЛица;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеФизическиеЛица.СтандартныеРеквизиты.Ссылка.Имя;
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеФизическиеЛица.СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(МетаданныеФизическиеЛица.Реквизиты.НаименованиеСлужебное.ПолноеИмя());
	Поля.Добавить(МетаданныеФизическиеЛица.Реквизиты.УточнениеНаименования.ПолноеИмя());
	Поля.Добавить(МетаданныеФизическиеЛица.Реквизиты.ФИО.ПолноеИмя());
	Поля.Добавить(МетаданныеФизическиеЛица.Реквизиты.Фамилия.ПолноеИмя());
	Поля.Добавить(МетаданныеФизическиеЛица.Реквизиты.Имя.ПолноеИмя());
	Поля.Добавить(МетаданныеФизическиеЛица.Реквизиты.Отчество.ПолноеИмя());
	Поля.Добавить(МетаданныеФизическиеЛица.Реквизиты.Инициалы.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ФИО";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеФизическиеЛица.СтандартныеРеквизиты.Ссылка.Имя;
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеФизическиеЛица.Реквизиты.МестоРождения.ПолноеИмя());
	Поля.Добавить(МетаданныеФизическиеЛица.Реквизиты.ДатаРождения.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ДатаМестоРождения";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеФизическиеЛица.СтандартныеРеквизиты.Ссылка.Имя;
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		МетаданныеФизическиеЛица.Реквизиты.ИНН.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "ИНН";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеФизическиеЛица.СтандартныеРеквизиты.Ссылка.Имя;
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеФизическиеЛица.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Регион.ПолноеИмя());
	Поля.Добавить(МетаданныеФизическиеЛица.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Город.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "МестоРегистрацииПроживания";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеФизическиеЛица.СтандартныеРеквизиты.Ссылка.Имя;
	КонтактнаяИнформацияРеквизиты = МетаданныеФизическиеЛица.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	Поля = Новый Массив; // Массив из Строка 
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.ЗначенияПолей.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.Значение.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.Представление.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.АдресЭП.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.НомерТелефона.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.НомерТелефонаБезКодов.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "КонтактнаяИнформация";
	
	// Справочники.Сотрудники
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = Метаданные.Справочники.Сотрудники.ПолноеИмя();
	НовыеСведения.ПолеСубъект = Метаданные.Справочники.Сотрудники.Реквизиты.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(Метаданные.Справочники.Сотрудники.СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Метаданные.Справочники.Сотрудники.Реквизиты.УточнениеНаименования.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ФИО";
	
	// Документы.ВедомостьНаВыплатуЗарплатыВБанк
	МетаданныеОбъекта = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВБанк;
	РеквизитыТабличнойЧастиСостав = МетаданныеОбъекта.ТабличныеЧасти.Состав.Реквизиты;
	РеквизитыТабличнойЧастиЗарплата = МетаданныеОбъекта.ТабличныеЧасти.Зарплата.Реквизиты;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧастиСостав.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		РеквизитыТабличнойЧастиСостав.НомерЛицевогоСчета.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "БанковскийСчет";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧастиЗарплата.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		РеквизитыТабличнойЧастиЗарплата.НомерЛицевогоСчета.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "БанковскийСчет";
	
	// Документы.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников
	МетаданныеОбъекта = Метаданные.Документы.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников;
	РеквизитыТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.Сотрудники.Реквизиты;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.Фамилия.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.Имя.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.Отчество.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ФИО";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.АдресЭлектроннойПочты.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.НомерМобильногоТелефона.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.НомерМобильногоТелефонаПредставление.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ТелефонДомашний.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ТелефонДомашнийПредставление.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ТелефонРабочий.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ТелефонРабочийПредставление.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "КонтактнаяИнформация";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.ДокументСерия.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ДокументНомер.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ДокументДатаВыдачи.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ДокументСрокДействия.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ДокументКемВыдан.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ДокументКодПодразделения.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ДокументНомерСерия.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ПаспортныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.ДатаРождения.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.МестоРождения.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.МестоРожденияПредставление.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ДатаМестоРождения";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.АдресДляИнформирования.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.АдресДляИнформированияПредставление.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.АдресПоПрописке.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.АдресМестаПроживанияПредставление.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "МестоРегистрацииПроживания";
	
	// Документы.ПодтверждениеЗачисленияЗарплаты
	МетаданныеОбъекта = Метаданные.Документы.ПодтверждениеЗачисленияЗарплаты;
	РеквизитыТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.Сотрудники.Реквизиты;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		РеквизитыТабличнойЧасти.НомерЛицевогоСчета.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "БанковскийСчет";
	
	// Документы.ПодтверждениеОткрытияЛицевыхСчетовСотрудников
	МетаданныеОбъекта = Метаданные.Документы.ПодтверждениеОткрытияЛицевыхСчетовСотрудников;
	РеквизитыТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.Сотрудники.Реквизиты;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		РеквизитыТабличнойЧасти.НомерЛицевогоСчета.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "БанковскийСчет";
	
	// РегистрыСведений.ДокументыФизическихЛиц
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.Физлицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ФамилияЛатиницей.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ИмяЛатиницей.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ФИО";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.Физлицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Серия.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Номер.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДатаВыдачи.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.СрокДействия.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.КемВыдан.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.КодПодразделения.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Представление.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ПаспортныеДанные";
	
	// РегистрыСведений.УдалитьЛицевыеСчетаСотрудниковПоЗарплатнымПроектам
	МетаданныеОбъекта = Метаданные.РегистрыСведений.УдалитьЛицевыеСчетаСотрудниковПоЗарплатнымПроектам;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		МетаданныеОбъекта.Ресурсы.НомерЛицевогоСчета.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "БанковскийСчет";
	
	// РегистрыСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		МетаданныеОбъекта.Ресурсы.НомерЛицевогоСчета.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "БанковскийСчет";
	
	// РегистрыСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.АдресДляИнформирования.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.АдресДляИнформированияПредставление.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.АдресМестаРаботы.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.АдресМестаРаботыПредставление.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "МестоРегистрацииПроживания";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.АдресЭлектроннойПочты.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.НомерМобильногоТелефона.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.НомерМобильногоТелефонаПредставление.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "КонтактнаяИнформация";
	
	// РегистрыСведений.ФИОФизическихЛиц
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ФИОФизическихЛиц;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Фамилия.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Имя.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Отчество.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Инициалы.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.ФИОСлужебные.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ФИО";
	
	// БанковскиеКарты.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект =  Метаданные.Справочники.БанковскиеКартыКонтрагентов.ПолноеИмя();
	НовыеСведения.ПолеСубъект = Метаданные.Справочники.БанковскиеКартыКонтрагентов.СтандартныеРеквизиты.Владелец.Имя;
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Метаданные.Справочники.БанковскиеКартыКонтрагентов.Реквизиты.ИмяДержателяКарты.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "ФИО";
	// БанковскиеКарты.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
	// ЗащитаПерсональныхДанныхЗарплатаКадрыБазовый.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
	
	// ЗащитаПерсональныхДанныхЗарплатаКадрыРасширенный.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная") Тогда
		// КадровыйУчетРасширенный.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
		МетаданныеОбъекта = Метаданные.РегистрыСведений.ФотографииФизическихЛиц;
		НовыеСведения = ТаблицаСведений.Добавить();
		НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
		НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
		НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МетаданныеОбъекта.Ресурсы.Фотография.ПолноеИмя());
		НовыеСведения.КатегорияДанных = "Фотография";
		
		МетаданныеОбъекта = Метаданные.РегистрыСведений.ИзменениеСведенийФизическихЛиц;
		НовыеСведения = ТаблицаСведений.Добавить();
		НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
		НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
		Поля = Новый Массив; // Массив из Строка
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПрежнееЗначение.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.УстановленноеЗначение.ПолноеИмя());
		НовыеСведения.Поля = Поля;
		НовыеСведения.КатегорияДанных = "ЛичныеДанные";
		
		МетаданныеОбъекта = Метаданные.РегистрыСведений.НаградыФизическихЛиц;
		НовыеСведения = ТаблицаСведений.Добавить();
		НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
		НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
		Поля = Новый Массив; // Массив из Строка
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.НомерПриказа.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДатаПриказа.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.НаименованиеПриказа.ПолноеИмя());
		НовыеСведения.Поля = Поля;
		НовыеСведения.КатегорияДанных = "Награды";
		
		МетаданныеОбъекта = Метаданные.РегистрыСведений.УченыеЗванияФизическихЛиц;
		НовыеСведения = ТаблицаСведений.Добавить();
		НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
		НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
		Поля = Новый Массив; // Массив из Строка
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДатаПрисвоенияУченогоЗвания.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.АттестатСерия.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.АттестатНомер.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.АттестатВыданОрганизация.ПолноеИмя());
		НовыеСведения.Поля = Поля;
		НовыеСведения.КатегорияДанных = "Образование";
		
		МетаданныеОбъекта = Метаданные.РегистрыСведений.УченыеСтепениФизическихЛиц;
		НовыеСведения = ТаблицаСведений.Добавить();
		НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
		НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
		Поля = Новый Массив; // Массив из Строка
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДатаПрисужденияУченойСтепени.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДиссертационныйСовет.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДипломСерияНомер.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДипломВыданОрганизация.ПолноеИмя());
		НовыеСведения.Поля = Поля;
		НовыеСведения.КатегорияДанных = "Образование";
		
		МетаданныеОбъекта = Метаданные.РегистрыСведений.ТрудоваяДеятельностьФизическихЛиц;
		НовыеСведения = ТаблицаСведений.Добавить();
		НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
		НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
		Поля = Новый Массив; // Массив из Строка
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.Организация.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДатаНачала.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДатаОкончания.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.Должность.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.Обязанности.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.СфераДеятельностиКомпании.ПолноеИмя());
		Поля.Добавить(МетаданныеОбъекта.Ресурсы.АдресОрганизации.ПолноеИмя());
		НовыеСведения.Поля = Поля;
		НовыеСведения.КатегорияДанных = "ОпытРаботы";
		
		МетаданныеОбъекта = Метаданные.РегистрыСведений.ДанныеДляПодбораСотрудников;
		НовыеСведения = ТаблицаСведений.Добавить();
		НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
		НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
		НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			МетаданныеОбъекта.Измерения.Наименование.ПолноеИмя());
		НовыеСведения.КатегорияДанных = "ФИО";
		// КадровыйУчетРасширенный.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.Документы.ИсполнительныйЛист;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Реквизиты.ФизическоеЛицо.Имя;
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.АдресПолучателя.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.АдресПолучателяПредставление.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "МестоРегистрацииПроживания";
	// ЗащитаПерсональныхДанныхЗарплатаКадрыРасширенный.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
	// ЗУП 3.1.28.65
	
	// ЗУПК
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ДоходыПредыдущегоМестаРаботы;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.СуммаДохода.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПримененнаяЛьгота.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ВОСМС.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.СведенияОПенсионномОбеспеченииФизическихЛиц;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПенсионерПоВозрасту.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПенсионерПоВыслугеЛет.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДатаРегистрацииИзменений.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ЛичныеДанные";
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.СведенияОФизическихЛицахУчастникахВОВ;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Статус.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДатаРегистрацииИзменений.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ЛичныеДанные";
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.СтатусФизическихЛицКакНалогоплательщиков;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Статус.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ИмеетПравоНаПенсионноеОбеспечение.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПодлежитСоциальномуСтрахованию.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПодлежитСоциальномуМедицинскомуСтрахованию.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ЛичныеДанные";
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ВычетыФизическихЛицИПН;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПредоставлятьВычет.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДействуетПо.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ЛичныеДанные";
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ЛьготыФизическихЛицИПН;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПредоставлятьЛьготу.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.КатегорияЛицаПолучателяЛьготы.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДействуетДо.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ЛичныеДанные";
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ПрочиеВычетыФизическихЛицИПН;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Размер.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДействуетПо.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ЛичныеДанные";
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.ВзаиморасчетыПоПрочимВыплатам;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.СуммаВзаиморасчетов.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.НалогиВзносыОтчисленияПоСотрудникам;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.СО.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.СН.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ОППВ.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ООСМС.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ОПВР.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.НалогВзнос.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.НалогиВзносыРасчетыНалогоплательщиков;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.НалогВзнос.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.СведенияОбИсчисленииВычетовИПН;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.РазрешенныйВычет.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПримененныйВычет.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ОблагаемыйДоход.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.НеоблагаемыйДоход.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.НалогВзнос.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ОбъектИсчисления.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПримененныйВычет.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.РазрешенныйВычет.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПримененнаяЛьгота.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ПрочиеВычеты.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.СведенияОДоходахФизическихЛиц;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.СуммаДохода.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.СуммаДохода.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.НеоблагаемыйДоход.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.ПениПоВзносамИОтчислениям;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Сумма.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.Документы.ВедомостьНаПеречислениеВзносовОтчислений;
	РеквизитыТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.НалогиВзносыОтчисления.Реквизиты;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.НалогВзнос.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.СуммаПлатежа.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.МесяцНалоговогоПериода.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.МесяцПериода.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.Документы.ВедомостьНаПеречислениеПрочихВыплат;
	РеквизитыТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.ПрочиеВыплаты.Реквизиты;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.Сумма.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ПериодВзаиморасчетов.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.Документы.ЗаявлениеНаПредоставлениеВычетовИПН;
	РеквизитыТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.Вычеты.Реквизиты;
	РеквизитыВторойТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.ПрочиеВычеты.Реквизиты;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Реквизиты.Сотрудник.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.ВидВычетаИПН.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ПредоставлятьВычет.ПолноеИмя());
	Поля.Добавить(РеквизитыВторойТабличнойЧасти.ВидВычетаИПН.ПолноеИмя());
	Поля.Добавить(РеквизитыВторойТабличнойЧасти.Размер.ПолноеИмя());
	Поля.Добавить(РеквизитыВторойТабличнойЧасти.ДействуетС.ПолноеИмя());
	Поля.Добавить(РеквизитыВторойТабличнойЧасти.ДействуетПо.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ЛичныеДанные";
	
	МетаданныеОбъекта = Метаданные.Документы.РегистрацияПрочихВыплат;
	РеквизитыТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.ПрочиеВыплаты.Реквизиты;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.СуммаНачисления.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ПериодВзаиморасчетов.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.Документы.ВедомостьНаВозвратПрочихВыплат;
	РеквизитыТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.ПрочиеВыплаты.Реквизиты;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.Сумма.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ПериодВзаиморасчетов.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.Документы.ПеняПоВзносамИОтчислениям;
	РеквизитыТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.ИсчислениеПени.Реквизиты;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = РеквизитыТабличнойЧасти.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(РеквизитыТабличнойЧасти.Сумма.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.СуммаЗадолженности.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.МесяцНалоговогоПериода.ПолноеИмя());
	Поля.Добавить(РеквизитыТабличнойЧасти.ПланируемаяДатаПеречисления.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	МетаданныеОбъекта = Метаданные.Документы.ПрекращениеПредоставленияВычетовИПН;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Реквизиты.Сотрудник.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.Месяц.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ЛичныеДанные";
	// ЗУПК
	
КонецПроцедуры

// Позволяет выполнить дополнительные действия перед уничтожением персональных данных субъектов. В том числе, отказаться
// от уничтожения персональных данных, добавив субъекта в таблицу исключений с указанием причины отказа от уничтожения.
// Или же добавить в массив субъектов других субъектов, данные которых тоже должны быть уничтожены. Например, если при 
// уничтожении данных физического лица должны быть уничтожены данные связанных с ним кандидатов.
//
// Параметры:
//   Субъекты - Массив из ОпределяемыйТип.СубъектПерсональныхДанных - ссылки на объекты данных, чьи персональные данные
//     будут уничтожены.
//   ТаблицаИсключений - ТаблицаЗначений:
//     * Субъект - ОпределяемыйТип.СубъектПерсональныхДанных
//     * ПричинаОтменыУничтожения - Строка
//    - таблица, в которую добавляются субъекты и причины отказа уничтожения их данных
//   ОтказОтСкрытия - Булево - (по умолчанию Истина) признак отказа от скрытия. Если определены причины отказа 
//                             от скрытия, то параметру необходимо установить значение Ложь.
Процедура ПередСкрытиемПерсональныхДанныхСубъектов(Субъекты, ТаблицаИсключений, ОтказОтСкрытия) Экспорт
	
	ЗарплатаКадры.ПередСкрытиемПерсональныхДанныхСубъектов(Субъекты, ТаблицаИсключений, ОтказОтСкрытия);
	
КонецПроцедуры

// Позволяет выполнить дополнительные действия при уничтожении персональных данных перед записью объекта,
// а также отказаться от записи объекта.
// 
// Параметры:
//  Объект - СправочникОбъект,ДокументОбъект
//  Субъекты - Массив из ОпределяемыйТип.СубъектПерсональныхДанных
//  ВыполнитьЗаписьОбъекта - Булево - если Ложь, то запись объекта не выполняется.
Процедура ПередУничтожениемПерсональныхДанных(Объект, Субъекты, ВыполнитьЗаписьОбъекта) Экспорт

КонецПроцедуры

// Позволяет выполнить дополнительные действия при уничтожении персональных данных после записи объекта.
// 
// Параметры:
//  Объект - СправочникОбъект,ДокументОбъект
//  Субъекты - Массив из ОпределяемыйТип.СубъектПерсональныхДанных
Процедура ПослеУничтоженияПерсональныхДанных(Объект, Субъекты) Экспорт

КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Срок хранения ПДн - это дата после которой необходимо уничтожить ПДн субъекта. Ранее этой даты уничтожить ПДн нельзя.
// Сроки хранения ПДн рассчитываются автоматически регламентным заданием РасчетСроковХраненияПерсональныхДанных.
// При наступлении события, которое влияет на срок хранения ПДн, необходимо с помощью метода
// ЗащитаПерсональныхДанных.ДобавитьСубъектыДляРасчетаСроковХранения зарегистрировать субъекта для расчета срока хранения.
// Такими событиями могут быть, например, создание нового физического лица, ввод согласия на обработку ПДн или
// прием сотрудника на работу.
// При расчете сроков хранения ПДн, в процедуре ПриРасчетеСроковХраненияПерсональныхДанных заполняется таблица значений,
// в которую различные подсистемы добавляют рассчитанные сроки хранения. Датой, при наступлении которой данные подлежат
// уничтожению, будет определена самая поздняя из всех заполненных для этого субъекта.

// Позволяет добавить в таблицу значений информацию о сроках хранения персональных данных.
// 
// Параметры:
//  ДанныеСубъектов - ТаблицаЗначений:
//   * Субъект - ОпределяемыйТип.СубъектПерсональныхДанных - ссылка на субъекта.
//   * ДатаСобытия - Дата - дата события, которое потребовало обновления срока хранения персональных данных.
//  СрокиХранения - ТаблицаЗначений:
//   * Субъект - ОпределяемыйТип.СубъектПерсональныхДанных - ссылка на субъекта
//   * СрокХранения - Дата - дата, до которой должны храниться персональные данные субъекта и при наступлении которой,
//     они должны быть уничтожены.
//   * Организация - ОпределяемыйТип.Организация - ссылка на организацию субъекта (если организацию определить
//     невозможно, не заполняется)
//   * Комментарий - Строка - произвольная строка с пояснением к рассчитанному сроку хранения.
Процедура ПриРасчетеСроковХраненияПерсональныхДанных(ДанныеСубъектов, СрокиХранения) Экспорт
	
КонецПроцедуры

#КонецОбласти
